---
kind: method
id: M:Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.#ctor(Autodesk.Revit.DB.Document)
source: html/bfcb69c6-abb2-8224-bee1-21db51c852ce.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.#ctor Method

Creates a new instance of the FabricationNetworkChangeService class.

## Syntax (C#)
```csharp
public FabricationNetworkChangeService(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - A document in which to change the service or size of the selected fabrication parts.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null